$(document).ready(function() {

	// var sym_list = [];

	// $.getJSON("data/data.json", function(data) {
	// 	$.each(data, function(index, value) {
	// 		sym_list.push(value);
	// 	});
	//
	// 	var input = document.getElementById("search_sym");
	// 	var awesomplete = new Awesomplete(input);
	// 	awesomplete.list = sym_list;
	// });

	var sym_list = ['纳可','脉沉细','舌暗红','小便正常','腹部畏寒','睡眠可','嗳气','苔黄腻','口干','旉','病史：','小便可','大小便正常','苔薄白','胃脘畏寒','脉弦','纳眠可','胃胀','苔薄黄','不祥','痞满','口苦','乏力','脉沉弦','纳差','脉沉','睡眠差','舌淡暗','舌暗红胖','苔白腻','反酸','大小便可','烧心','舌暗','眠可','大便正常','大便不成形','纳好','大便干','肠鸣','舌红','睡眠欠佳','胃痛','腹胀','口臭','无烧心反酸','苔黄','脉弦细','舌暗胖','睡眠好转','失眠','恶心','舌淡暗胖','有裂纹','手足凉','咽干','头晕','小便调','偶反酸','苔薄白腻','二便调','睡眠正常','舌紫暗','苔薄黄腻','大便成形','大便可','纳增','汗多','偶烧心','心悸','不能进食生冷','苔黄厚腻','大便不畅','偶嗳气','梦多','无胃痛','否认','排出困难','舌淡','胸闷','腰痛','咳嗽','烧心反酸','睡眠多梦','易醒','腹泻','咽部异物感','背痛','口干口苦','胃脘不适','嗳气减轻','小便黄','苔腻略黄','舌淡胖','全身畏寒','易感冒','偶恶心','不成形','目干','舌紫暗胖','脉细','偶胃痛','不喜食冷','口粘','眠中易醒','耳鸣','时有胃胀','畏寒','胃痛消失','脉沉细弦','纳减','时有胃痛','脉沉细弱','眠差','眠欠佳','精神可','边有齿痕','头痛','大便次数多','睡眠好','苔白','无胃胀','胃胀减轻','时有嗳气','尿频','睡眠有时欠佳','舌淡红','眠好','睡眠质量差','唇干','排不尽感','纳少','量少','夜间口干','舌尖红','胃脘隐痛','无腹痛','食欲可','偶胃胀','无反酸','无烧心','乏力好转','咽中有痰','排出不畅','大便粘','月经量少','时有心悸','食后胃胀','反酸消失','腹部畏寒减轻','胃胀消失','偶腹胀','晨起口干','入睡困难','病情好转','易上火','多梦','腹痛','苔中根部黄腻','时有腹胀','腹胀减轻','时有腹痛','排气多','咽痛','晨起口苦','脉滑','入睡难','无粘液脓血','夜尿多','苔薄略黄','舌偏红','大小便调','时有反酸','醒后难再入睡','口腔异味','时有烧心','腰酸','心烦','胃脘部气上逆感','舌紫暗红','时有头晕','苔薄腻','小便多','进食后嗳气','纳一般','偶烧心反酸','苔白腻略黄','食后痞满','时有恶心','大便基本成形','胸骨后不适','反酸减轻','大便少','流涕','小便频数','不能多食','受凉后加重','脐周隐痛','大便不干','睡眠一般','不能食冷','便秘','嗳气不畅','质粘','纳不香','急躁易怒','矢气多','有便不尽感','胃痛好转','夜间明显','手足心热','口苦消失','量多','肠鸣减轻','夜尿1-2次','无腹胀','小便频','反复口腔溃疡','胸骨后烧灼感','苔白略腻','胃胀好转','脉弦缓','大便干结','近日感冒','时有腹泻','食欲好','体重下降','舌暗淡','烧心减轻','乳房胀痛','量不多','基本成形','双下肢肿','略黄','时有失眠','乏力明显好转','晨起口臭','口干不欲饮','症状好转','大便干减轻','左下肢浮肿','夜间口干,纳可','小便好','气短','无恶心','月经正常','早醒','得嗳气则舒','成形','苔少','胃痛减轻','苔根部黄腻','嗳气消失','口干减轻','咽痒','喜叹息','脱发','咽部不适','大便不成形好转','苔薄白略黄','厌油腻','咳痰','足凉','反复胃痛','乏津','无恶心呕吐','盗汗','眠好转','脉弦数','腹泻好转','汗出','食后嗳气','偶呕吐','腹部畏寒明显','偶有胃痛','感冒不多','无痰','偶有便不尽感','口臭消失','有齿痕','舌下脉络瘀曲','大便多不成形','两胁痛','偶结','里急后重','胃脘发凉','手足汗多','大小便无力','舌前部及中部局部无苔','食欲欠佳','大便欠成形','右上腹疼痛','口臭减轻','恶心消失','嗳气频作','苔薄腻略黄','有时不成形','胸痛','有瘀斑','失眠好转','局部剥脱','舌痛','偶痞满','无口干','苔薄白略腻','痞满消失','胃脘不适好转','气上逆感','受凉易腹泻','腹胀消失','脉滑数','矢气','胁胀','面黄','脉沉细数','舌暗淡胖','感冒偏多','咽部异物感减轻','喜饮','大便欠畅','腹部畏寒好转','影响睡眠','受凉易作','乏力减轻','头晕好转','口苦口干','左侧腹痛','食欲不振','消瘦','便溏','按之觉痛','食欲差','纳略增','无胃脘疼痛','右上腹不适','少津','感冒多','咽干咽痛','脉沉细无力','腹胀不明显','口干渴','有时成形有时不成形','苔灰腻','腹泻减轻','小腹痛','喜睡','无明显不适','脉右沉细','舌胖','颈部疼痛','大便基本正常','四肢乏力','前干后溏','脉细弦数','小便有时困难','口唇白','晚餐后明显','稍食多则痞满','头沉减轻','醒后疲乏','易被惊吓','病史：旉','大便有时不成形','纳眠好','睡眠不实','脉弦滑','面色黄','时有口干','胃中沥沥有声','呕吐','病史：不祥','苔白厚腻','口苦减轻','形体消瘦','偶口干','偶心悸','视物模糊','月经不调','时有烧心反酸','胸骨后灼热感','进食后明显','无吞咽困难','痛经','便不尽感','畏风','色白','痰多','经期腹痛','质干','泻前腹痛','大便困难','嗳气好转','根部薄黄','小便少','时有头痛','胃脘痞满','苔黄白腻','腹中气多','苔黄略腻','偶咳痰','泻后则安','大便畅','口干舌燥','脉沉细缓','无腹胀腹痛','晨起明显','排出畅','左上腹疼痛','胃脘胀满','舌木','食后明显','偶右上腹疼痛','疼痛','大便排出困难','月经周期可','腹中不适','大便有时干','牙龈出血','近日反复','头晕减轻','腹部畏寒消失','大便粘好转','反复感冒','关节疼痛','晨起咳痰','背部畏寒','口干苦','鼻燥','偶隐痛','足跟痛','反酸减少','肠鸣消失','苔黄白','自汗','右沉','不能进食油腻','大小正常','夜间肠鸣','夜尿1-3次','眠正常','无腹中不适','烧心反酸略减','左沉','吞咽无不畅','畏寒好转','右下腹痛减轻','偶右侧腹部隐痛','腹部无不适','饮食不慎则反食','时有肠鸣矢气','鼻塞减轻','近来腰部不适','足凉消失','咽干鼻燥好转','时晚上及晨起头晕','皮痒','全身肿好转','食后难消','口腔溃疡','烧心消失','进食后胃胀','无嗳气','鼻塞','夹有血块','大便时干时稀','苔腻','脉细弦','嗳气减少','畏脘畏寒','食欲好转','无呕吐','脉沉缓','大便不尽感','无发热','反复腹泻','烧心反酸消失','口涩','腹部下坠感','饮食控制','偶腹痛','上腹痛','大便不规律','偶胃脘隐痛','饮食不慎则腹泻','口干好转','反酸好转','手心热','便秘好转','上腹胀满','大便黑','无心悸','无胃痛胃胀','时有肠鸣','量偏少','睡眠时好时差','双下肢乏力','瘙痒','无脓血','舌淡边有齿痕','继则不成形'];

	var input = document.getElementById("search_sym");
	var awesomplete = new Awesomplete(input);
	awesomplete.list = sym_list;

});
